#hiragana_to_katakana() 함수는 히라가나로 들어온 문자열을 가타카나로 변환하거나, 가타카나로 들어온 문자열을 히라가나로 변환하여 출력하는 함수입니다.
#만약 hiragana_to_katakana에 True가 들어온다면 히라가나를 가타카나로, False가 들어온다면 가타카나를 히라가나로 변환합니다. a는 문자열이 들어옵니다.
#히라가나, 가타카나 이외의 한자, 로마자, 한글 등은 그대로 return 됩니다.

def hiragana_to_katakana(hiragana_to_katakana, a):
    a = list(a)
    hiragana2katakana = {'あ':'ア', 'い':'イ', 'う':'ウ', 'え':'エ', 'お':'オ', 'か':'カ', 'き':'キ', 'く':'ク', 'け':'ケ', 'こ':'コ', 'さ':'サ', 'し':'シ', 'す':'ス', 'せ':'セ', 'そ':'ソ', 'た':'タ', 'ち':'チ', 'つ':'ツ', 'て':'テ', 'と':'ト', 'な':'ナ', 'に':'ニ', 'ぬ':'ヌ', 'ね':'ネ', 'の':'ノ', 'は':'ハ', 'ひ':'ヒ', 'ふ':'フ', 'へ':'へ', 'ほ':'ホ', 'ま':'マ', 'み':'ミ', 'む':'ム', 'め':'メ', 'も':'モ', 'や':'ヤ', 'ゆ':'ユ', 'よ':'ヨ', 'ら':'ラ', 'り':'リ', 'る':'ル', 'れ':'レ', 'ろ':'ロ', 'わ':'ワ', 'を':'ヲ', 'ん':'ン', 'ぎ':'ギ', 'が':'ガ', 'ぐ':'グ', 'げ':'ゲ', 'ご':'ゴ', 'ざ':'ザ', 'じ':'ジ', 'ず':'ズ', 'ぜ':'ゼ', 'ぞ':'ゾ', 'だ':'ダ', 'ぢ':'ヂ', 'づ':'ヅ', 'で':'デ', 'ど':'ド', 'ば':'バ', 'び':'ビ', 'ぶ':'ブ', 'べ':'ベ', 'ぼ':'ボ', 'ぱ':'パ', 'ぴ':'ピ', 'ぷ':'プ', 'ぺ':'ペ', 'ぽ':'ポ', 'ゃ':'ャ', 'ゅ':'ュ', 'ょ':'ョ', 'ぁ':'ァ', 'ぃ':'ィ', 'ぅ':'ゥ', 'ぇ':'ェ', 'ぉ':'ォ'} 
    if hiragana_to_katakana:
        for i in range(len(a)):
            if a[i] in hiragana2katakana:
                a[i] = hiragana2katakana[a[i]]
    else:
        katakana2hiragana = {}
        for k, v in hiragana2katakana.items():
            katakana2hiragana[v] = k
        for i in range(len(a)):
            if a[i] in katakana2hiragana:
                a[i] = katakana2hiragana[a[i]]
    
    return "".join(a)
